In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [10]:
df=pd.read_csv('Country-data.csv')

In [11]:
df.head()

,country,child_mort,exports,health,imports,income,inflation,life_expec,total_fer,gdpp
0,Afghanistan,90.2,10.0,7.58,44.9,1610,9.44,56.2,5.82,553
1,Albania,16.6,28.0,6.55,48.6,9930,4.49,76.3,1.65,4090
2,Algeria,27.3,38.4,4.17,31.4,12900,16.10,76.5,2.89,4460
3,Angola,119.0,62.3,2.85,42.9,5900,22.40,60.1,6.16,3530
4,Antigua and Barbuda,10.3,45.5,6.03,58.9,19100,1.44,76.8,2.13,12200

In [32]:
df[df.gdpp==df.gdpp.max()]

,country,child_mort,exports,health,imports,income,inflation,life_expec,total_fer,gdpp
91,Luxembourg,2.8,175.0,7.77,142.0,91700,3.62,81.3,1.63,105000

In [38]:
df[df.gdpp==df.gdpp.min()]

,country,child_mort,exports,health,imports,income,inflation,life_expec,total_fer,gdpp
26,Burundi,93.6,8.92,11.6,39.2,764,12.3,57.7,6.26,231

In [39]:
df['country'][df.gdpp==df.gdpp.max()]

91    Luxembourg
Name: country, dtype: object

In [40]:
df[['country','gdpp']][df.gdpp==df.gdpp.max()]

       country    gdpp
91  Luxembourg  105000

In [42]:
df[['country','gdpp']][df.gdpp==df.gdpp.min()]

    country  gdpp
26  Burundi   231

In [46]:
df[['country','inflation']][df.inflation==df.inflation.max()]

     country  inflation
113  Nigeria      104.0

In [48]:
df[['country','inflation']][df.inflation==df.inflation.min()]

        country  inflation
131  Seychelles      -4.21

In [51]:
df.imports

0      44.9
1      48.6
2      31.4
3      42.9
4      58.9
       ...
162    52.7
163    17.6
164    80.2
165    34.4
166    30.9
Name: imports, Length: 167, dtype: float64

In [52]:
df.imports.max()

174.0

In [54]:
df['country'][df.imports==df.imports.max()]

133    Singapore
Name: country, dtype: object

In [56]:
df[['country','imports']][df.imports==df.imports.max()]

       country  imports
133  Singapore    174.0

In [59]:
df[df.imports==df.imports.min()]

,country,child_mort,exports,health,imports,income,inflation,life_expec,total_fer,gdpp
107,Myanmar,64.4,0.109,1.97,0.0659,3720,7.04,66.8,2.41,988

In [64]:
df['country'][df.life_expec==df.life_expec.max()]

77    Japan
Name: country, dtype: object

In [63]:
df[['country','life_expec']][df.life_expec==df.life_expec.max()]

   country  life_expec
77   Japan        82.8

In [75]:
df_top_10=df.sort_values(by='gdpp',ascending=False)

In [76]:
df_top_10.head(10)

,country,child_mort,exports,health,imports,income,inflation,life_expec,total_fer,gdpp
91,Luxembourg,2.8,175.0,7.77,142.0,91700,3.620,81.3,1.63,105000
114,Norway,3.2,39.7,9.48,28.5,62300,5.950,81.0,1.95,87800
145,Switzerland,4.5,64.0,11.50,53.3,55500,0.317,82.2,1.52,74600
123,Qatar,9.0,62.3,1.81,23.8,125000,6.980,79.5,2.07,70300
44,Denmark,4.1,50.5,11.40,43.6,44000,3.220,79.5,1.87,58000
144,Sweden,3.0,46.2,9.63,40.7,42900,0.991,81.5,1.98,52100
7,Australia,4.8,19.8,8.73,20.9,41400,1.160,82.0,1.93,51900
110,Netherlands,4.5,72.0,11.90,63.6,45500,0.848,80.7,1.79,50300
73,Ireland,4.2,103.0,9.19,86.5,45700,-3.220,80.4,2.05,48700
159,United States,7.3,12.4,17.90,15.8,49400,1.220,78.7,1.93,48400

In [77]:
df_top_10[['country','gdpp']].head(10)

           country    gdpp
91      Luxembourg  105000
114         Norway   87800
145    Switzerland   74600
123          Qatar   70300
44         Denmark   58000
144         Sweden   52100
7        Australia   51900
110    Netherlands   50300
73         Ireland   48700
159  United States   48400